#pragma once

/* 4 bytes IP address */
typedef struct ip_address
{
	u_char byte1;
	u_char byte2;
	u_char byte3;
	u_char byte4;
}ip_address;


/*                       IP报文格式
	0            8           16                        32
	+------------+------------+-------------------------+
	| ver + hlen |  服务类型   |          总长度          |
	+------------+------------+----+--------------------+
	|           标识位         |flag|    分片偏移(13位)   |
	+------------+------------+----+--------------------+
	|   生存时间  | 高层协议号   |        首部校验和        |
	+------------+------------+-------------------------+
	|                   源 IP 地址                       |
	+---------------------------------------------------+
	|                  目的 IP 地址                      |
	+---------------------------------------------------+

*/
/* IPv4 header */
typedef struct ip_header
{
	u_char	ver_ihl;		// Version (4 bits) + Internet header length (4 bits)
	u_char	tos;			// Type of service 
	u_short tlen;			// Total length 
	u_short identification; // Identification
	u_short flags_fo;		// Flags (3 bits) + Fragment offset (13 bits)
	u_char	ttl;			// Time to live
	u_char	proto;			// Protocol
	u_short crc;			// Header checksum
	ip_address	saddr;		// Source address
	ip_address	daddr;		// Destination address
	u_int	op_pad;			// Option + Padding
}ip_header;

/* UDP header*/
typedef struct udp_header
{
	u_short sport;			// Source port
	u_short dport;			// Destination port
	u_short len;			// Datagram length
	u_short crc;			// Checksum
}udp_header;




/*
			   ICMP协议格式
   0        8       16                32
   +--------+--------+-----------------+
   |  类型  |  代码   |      校验和      |
   +--------+--------+-----------------+
   |          不同的类型和代码           |
   |            有不同的内容            |
   +-----------------------------------+
   /
   请求和回显
   +-----------------------------------+
   |      标识符      |      序号        |
   +-----------------+-----------------+
*/

struct ICMP_HEADER
{
	byte type;
	byte code;
	byte checkSum[2];
	//byte other[512];  
};

/*
			   ICMP 请求报文                             ICMP 应答报文
	+--------+--------+---------------+        +--------+--------+---------------+
	|  类型  |  代码   |      描述      |        |  类型  |  代码  |      描述     |
	+--------+--------+---------------+        +--------+--------+---------------+
	|    8   |    0   |    回显请求    |        |    0   |    0   |    回显回答   |
	+--------+--------+---------------+        +--------+--------+---------------+
	|   10   |    0   |   路由器请求   |        |    9   |    0   |   路由器回答  |
	+--------+--------+---------------+        +--------+--------+---------------+
	|   13   |    0   |   时间戳请求   |        |   14   |    0   |   时间戳回答  |
	+--------+--------+---------------+        +--------+--------+---------------+
	|   15   |    0   | 信息请求(废弃)  |        |   16   |    0   | 信息回答(废弃)|
	+--------+--------+---------------+        +--------+--------+---------------+
	|   17   |    0   | 地址掩码请求    |        |   18   |    0   | 地址掩码回答  |
	+--------+--------+---------------+        +--------+--------+---------------+

								ICMP协议请求 / 回答报文格式
							0        8       16                32
							+--------+--------+-----------------+
							|  类型   |  代码   |     校验和      |
							+--------+--------+-----------------+
							|      标识符      |      序号       |
							+-----------------+-----------------+
							|             回显数据               |
							+-----------------+-----------------+

 */
                                                                                                                                                                               